# TODO
n=[]
a=[0]*10
for i in range(0,10): #for找10次
  num = eval(input())
  n.append(num)
  a[n.index(num)]+=1
  
print(n[a.index(max(a))]  )
print(max(a))
#---------------------------------思維
# n = [ , , , , , , , , , ]
# a = [0,0,0,0,0,0,0,0,0,0]

# n填入一個新的數 a就在相對位置+1 
# n = [3, , , , , , , , , ]
# a = [1,0,0,0,0,0,0,0,0,0]
# n = [3,43, , , , , , , , ]
# a = [1,1,0,0,0,0,0,0,0,0]

# 如果n填入一個重複數 就用 n.index(num) 找回第幾個位置 比如說輸入3 則找回 第0個位置
# 則在 a列表的第0格加1 →  a[n.index(num)] += 1
# 假設最後
# n = [3,43,24,3,87,3,3,5,4,7]
# a = [4,1,1,0,1,0,0,1,1,1]
# max(a) = 4
# n[a.index(max(a))] 
# 1.找到次數max(a)
# 2.找到是a的第幾格 a.index(max(a))
# 3.帶回n列表內 n[a.index(max(a))] 